## Submitted by:

# Name-Suresh Kumar Prajapati

## Enroll.no. CUSB23022220008

## Date: 10/10/2024

## Assignment 4 rth Unit

## Submitted to:

# Dr. Indrajeet Kumar

# 1. Pandas
It is a package useful for data analysis and manipulation.

Pandas provide an easy way to create, manipulate and wrangle the data. 

Pandas provide powerful and easy-to-use data structures, as well 
as the means to quickly perform operations on these structures. 

## Data scientist use Pandas for its following advantages.

1: Easily handles missing data. 

2: It uses Series for one-dimensional data structure and DataFrame 
for multi-dimensional data structure.

3: It provides an efficient way to slice the data.

4: It provides a flexible way to merge, concatenate or reshape the data.

## Data structure in Pandas

1: Series
2: Data Frame
3: Panel

# 2. DataFrame

It is a two-dimensional object that is useful  in representing data in the form of rows and columns.  It is similar to a spreadsheet or an SQL table. This is the most commonly used pandas object. Once we store the data into the Dataframe, we can perform various operations that are useful in analyzing and understanding the data.

## Properties of dataFrame

1. A Dataframe has axes  (indices)-

➢ Row index (axis=0) 
➢ Column index (axes=1)

2. It is similar to a spreadsheet , whose row index is called index and 
column index is called column name.

3. A Dataframe contains Heterogeneous data. 

4. A Dataframe Size is Mutable.

5. A Dataframe Data is Mutable. 

#   A DataFrame can be created using any following -

1: Series
2: Lists
3: Dictonary
4: A numpy 2D array

## 2.1 To create a pandas dataframe by using series

In [1]:
import pandas as pd 

# To initialize to dicts of Series
point={'ram_number':pd.Series([2,3,8,7],index=['p','q','r','s']),
       'shyam_number':pd.Series(range(1,9,2),index=['p','q','r','s'])}

# To create a dataframe
df=pd.DataFrame(point)
print(df)

   ram_number  shyam_number
p           2             1
q           3             3
r           8             5
s           7             7

## 2.2 To create a dataframe by using Lists

In [2]:
# import pandas as pd
import pandas as pd
name=['reyon','ramlal','ramjanak','pradip','jayprakash']
marks=[83,76,78,65,80]
df=pd.DataFrame(name,index=[y for y in 'abcde'])
print(df)

            0
a       reyon
b      ramlal
c    ramjanak
d      pradip
e  jayprakash

## 2.3 To create a dataframe by using dictonary and  ndarray/lists

In [3]:
import pandas as pd

# To initialise data of lists.
data={'Name':['reyon','ramlal','ramjanak','pradip','jayprakash'],
    'Marks%':[83,76,78,65,80] }

# To create the dataframe 
df=pd.DataFrame(data)
print(df)

         Name  Marks%
0       reyon      83
1      ramlal      76
2    ramjanak      78
3      pradip      65
4  jayprakash      80

In [4]:
# DataFrame from Dictonary of series
import pandas as pd
name=pd.Series(['Dhoni','Yuvraj','Suresh Raina'])
team=pd.Series(['CS','KP','CSK'])
dic={'Name':name,'Team':team}
df=pd.DataFrame(dic)
df

           Name Team
0         Dhoni   CS
1        Yuvraj   KP
2  Suresh Raina  CSK

## 2.4 2D Numpy array

In [6]:
import pandas as pd
import numpy as np
arr=np.array([[1,4],[2,3],[6,8]])
df=pd.DataFrame(arr,columns=['A','B'])
print(df)

   A  B
0  1  4
1  2  3
2  6  8

In [1]:
import pandas as pd

# Create a 2D list
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

# Convert the 2D list into a DataFrame
df = pd.DataFrame(data, columns=['A', 'B', 'C'])

print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
#  head():  Returns the first n rows. 
#  tail():  Returns the last n rows. 
#  info():  Provides a summary of the DataFrame. 
#  describe():  Generates descriptive statistics. 
#  sort_values():  Sorts the DataFrame by specified columns. 
#  groupby():  Groups the DataFrame using a mapper or by series of columns.
#  merge():  Merges DataFrame or named series objects with a database-style join. 
#  apply():  Applies a function along the axis of the DataFrame. 
#  drop():  Removes specified labels from rows
#  pivot_table():  Creates a pivot table. 
#  fillna(): Fills NA/NaN values. 
#  isnull():  Detects missing values.

# 3. Python Pandas Series

Pandas series is one-dimensional labeled arrary capable of holding data of 

any type (integer,string,float,python objects,etc)

In [2]:
# To create DataFrame from Series
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

##  1:- Create a Pandas Series:

Series Object>=pandas.Series (data, index=idx (optional))

Python sequence (Lists,ndarray,scalar value, or a python dictionary)

## (a) Creating a series from array

In [3]:
# How to create Series with nd array
import pandas as pd
import numpy as np

# simple array
arr=np.array([4,5,1,8,9,0])
s=pd.Series(arr)
print(s)

0    4
1    5
2    1
3    8
4    9
5    0
dtype: int32

## (b) Creating a series from lists

In [4]:
import pandas as pd
import numpy as np

# a simple list
list=['a','b','c','d','e']

# Create a series from list
list_series=pd.Series(list)
print(list_series)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [5]:
# To name the index
s=pd.Series(arr,index=['first','second','third','fourth','fifth','sixth'])
print(s)

first     4
second    5
third     1
fourth    8
fifth     9
sixth     0
dtype: int32

In [ ]:
# To Create a series from Scalar value
import pandas as pd
s=pd.Series(-3,index=[0,1,2,3,4])
print(s)

##  (c) Creating a series from dictonary

In [6]:
# creating a Series from dictonary
import pandas as pd

# to create a dictonary
frame={'Name':'Rajia Sultan','Status':'President of delhi capital','Marital status':'Married'}

# To create a series
s=pd.Series(frame)
print(s)

Name                            Rajia Sultan
Status            President of delhi capital
Marital status                       Married
dtype: object

## (d) Creating a series using Numpy functions

numpy.linspace(start,end,how_number), numpy.random.radn()

In [7]:
import pandas as pd
import numpy as np

#  series with numpy linspace()
ser1=pd.Series(np.linspace(4,10,4))
print(ser1)

0     4.0
1     6.0
2     8.0
3    10.0
dtype: float64

##  (e)Creating the series using range function:

In [8]:
import pandas as pd
ser2=pd.Series(range(5))
print(ser2)

0    0
1    1
2    2
3    3
4    4
dtype: int64

## (f) Creating a Series using loop and list

range(start,end,gap_number)

In [9]:
import pandas as pd
ser3=pd.Series(range(1,10,2),index=[y for y in 'reyon'])
print(ser3)

r    1
e    3
y    5
o    7
n    9
dtype: int64

## (g) Creating a Series usin mathematical expressions

In [10]:
import numpy as np 
import pandas as pd
ser4=np.arange(1,5)
sub=pd.Series(data=ser4-1,index=[y for y in'raju'])
print(sub)

r    0
a    1
j    2
u    3
dtype: int32

# 4. Selection in Series & indexing

Series provides  index label loc and ilocand[] to access rows and columns

Syntax:-series_name.loc[StartRange: StopRange] use for labels

Syntax:-series_name.iloc[StartRange: StopRange] use for positions

Syntax:-series_name.ix[StartRange: StopRange]

In [11]:
import numpy as np # import numpy as np
import pandas as pd  # import pandas as pd
arr=np.array([3,4,5,9,1,0]) # To gererate array
s=pd.Series(arr)
print(s)
print(s.loc[:1])   # loc use for lebels
print(s.loc[0:3])
print(s.loc[3:5])

0    3
1    4
2    5
3    9
4    1
5    0
dtype: int32
0    3
1    4
dtype: int32
0    3
1    4
2    5
3    9
dtype: int32
3    9
4    1
5    0
dtype: int32

In [12]:
import numpy as np # import numpy as np
import pandas as pd  # import pandas as pd
print(s)
print(s.iloc[:1]) # it is use for position
print(s.iloc[0:3])
print(s.iloc[3:5])

0    3
1    4
2    5
3    9
4    1
5    0
dtype: int32
0    3
dtype: int32
0    3
1    4
2    5
dtype: int32
3    9
4    1
dtype: int32

## 4.1 indexing

In [13]:
# DataFrame from List of Dictonaries
import pandas as pd
l=[{'Name':'Suresh','SirName':'Indrajeet','index':['Student1']},{'Name':'Akash'
        ,'SirName': 'Abha Tiwari','index':['Student2']},{'Name':'Naveen singh'
                    ,'SirName':'Sarnath','index':['Student3']}]
df1=pd.DataFrame(l)
print(df1)

# To use indexing method
print(df1[['SirName','index']])

           Name      SirName       index
0        Suresh    Indrajeet  [Student1]
1         Akash  Abha Tiwari  [Student2]
2  Naveen singh      Sarnath  [Student3]
       SirName       index
0    Indrajeet  [Student1]
1  Abha Tiwari  [Student2]
2      Sarnath  [Student3]

## 4.2 Iteration on Rows and Columns
If we want to access record or data from a data frame row wise or 
column wise then iteration is used. Pandas provide 2 functions to 
perform iterations-

1. iterrows () 

2. iteritems ()

In [15]:
# iterrows()
import pandas as pd
l=l=[{'Name':'Suresh','SirName':'Indrajeet'},{'Name':
        'Akash','SirName':'Abha Tiwari'}
  ,{'Name':'Naveen singh','SirName':'Sarnath '}]
df1=pd.DataFrame(l)
print(df1)
for (row_index,row_value) in df1.iterrows():
    print('\n Row index is :',row_index)
    print(row_value)

           Name      SirName
0        Suresh    Indrajeet
1         Akash  Abha Tiwari
2  Naveen singh     Sarnath

 Row index is : 0
Name          Suresh
SirName    Indrajeet
Name: 0, dtype: object

 Row index is : 1
Name             Akash
SirName    Abha Tiwari
Name: 1, dtype: object

 Row index is : 2
Name       Naveen singh
SirName        Sarnath
Name: 2, dtype: object

In [17]:
# iteritems()
#It is used to access the data column wise.

import pandas as pd
l=l=[{'Name':'Suresh','SirName':'Indrajeet'},
     {'Name':'Akash','SirName':'Abha Tiwari'}
  ,{'Name':'Naveen singh','SirName':'Sarnath '}]
df1=pd.DataFrame(l)
print(df1)
for(col_name,col_value) in df1.items():
    print('\n')
    print('\n Column Name is :',col_name)
    print('\n Column Values are:',col_value)

           Name      SirName
0        Suresh    Indrajeet
1         Akash  Abha Tiwari
2  Naveen singh     Sarnath



 Column Name is : Name

 Column Values are: 0          Suresh
1           Akash
2    Naveen singh
Name: Name, dtype: object



 Column Name is : SirName

 Column Values are: 0      Indrajeet
1    Abha Tiwari
2       Sarnath
Name: SirName, dtype: object

## 4.3 DataFrame indexing related operation

In [18]:
# Select operation in data frame
import pandas as pd 
mydata={'ID':[100,101,102,103,104,105],'name':
        ['ramya','surya','deepika',
            'radhika','sakshi','madhuri'],
        
        'Doj':['12-01-2012','11-04-2012','2-01-2012','7-01-2012'
               ,'12-08-2012','25-09-2012',]}
df=pd.DataFrame(mydata)
df

    ID     name         Doj
0  100    ramya  12-01-2012
1  101    surya  11-04-2012
2  102  deepika   2-01-2012
3  103  radhika   7-01-2012
4  104   sakshi  12-08-2012
5  105  madhuri  25-09-2012

In [19]:
df.ID

0    100
1    101
2    102
3    103
4    104
5    105
Name: ID, dtype: int64

In [20]:
df[['ID','name']]

    ID     name
0  100    ramya
1  101    surya
2  102  deepika
3  103  radhika
4  104   sakshi
5  105  madhuri

In [22]:
df.rename(columns={'ID':'Cabin_number'})

   Cabin_number     name         Doj
0           100    ramya  12-01-2012
1           101    surya  11-04-2012
2           102  deepika   2-01-2012
3           103  radhika   7-01-2012
4           104   sakshi  12-08-2012
5           105  madhuri  25-09-2012

In [23]:
# To add new column with 20 entry
df['list']=20
df

    ID     name         Doj  list
0  100    ramya  12-01-2012    20
1  101    surya  11-04-2012    20
2  102  deepika   2-01-2012    20
3  103  radhika   7-01-2012    20
4  104   sakshi  12-08-2012    20
5  105  madhuri  25-09-2012    20

In [24]:
df.pop('list')  #For delete the column by using pop(),drop()
df

    ID     name         Doj
0  100    ramya  12-01-2012
1  101    surya  11-04-2012
2  102  deepika   2-01-2012
3  103  radhika   7-01-2012
4  104   sakshi  12-08-2012
5  105  madhuri  25-09-2012

In [25]:
import pandas as pd
s=pd.Series([10,20,30,40])
df=pd.DataFrame(s)
df.columns=['list']
df['list1']=40
df1=df.drop('list1',axis=1)      # (axis=1)delete the data column wise
df2=df.drop(index=[2,3],axis=0) 
# (axis=0) means to delete data row wise with given index

print(df)
print('after deletion:\n',df1)
print('after row deletion:\n')
print(df2)

   list  list1
0    10     40
1    20     40
2    30     40
3    40     40
after deletion:
    list
0    10
1    20
2    30
3    40
after row deletion:

   list  list1
0    10     40
1    20     40

## 4.4The use of loc and iloc

In [26]:
df
df[['list2','list3']]=[50,20]   # To add the column in listwise
print(df)
print(df.loc[:,'list':'list1']) # To print the only two column
print(df.loc[0:1])  # To print the row 0 and 1
print(df.iloc[0:2,1:2]) # To print two row and first columnn of list1
print(df.iloc[:,0:2])  # To print entire row and two column list and list1

   list  list1  list2  list3
0    10     40     50     20
1    20     40     50     20
2    30     40     50     20
3    40     40     50     20
   list  list1
0    10     40
1    20     40
2    30     40
3    40     40
   list  list1  list2  list3
0    10     40     50     20
1    20     40     50     20
   list1
0     40
1     40
   list  list1
0    10     40
1    20     40
2    30     40
3    40     40

# 5. Boolean Indexing in DataFrame
To create DataFrame with a boolean index to use the boolean indexing

In [27]:
import pandas as pd
dic={'Name':['Umeshawar','Ashish','Suresh'],
    'Age':[26,27,28]}

# To creating a DataFrame with boolean index vector
df=pd.DataFrame(dic,index=[True,False,True])
print(df)

print(df.loc[True])
print(df.iloc[0:1])

            Name  Age
True   Umeshawar   26
False     Ashish   27
True      Suresh   28
           Name  Age
True  Umeshawar   26
True     Suresh   28
           Name  Age
True  Umeshawar   26

# 6.Concat operation in data frame

Pandas provides various facilities for easily combining together Series, 
DataFrame.

pd.concat(objs, axis=0, join='outer', join_axes=None,ignore_index=False)

In [28]:
import pandas as pd
dic1={'id':['1','2','3','4','5'],'Value1':['A','C','G','I','S'],
      'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'Value1':['K','M','O','Q','S'],
      'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df1

  id Value1 Value2
0  1      A      B
1  2      C      D
2  3      G      F
3  4      I      H
4  5      S      J

In [29]:
df2=pd.DataFrame(dic2)
df2

  id Value1 Value2
0  2      K      L
1  3      M      N
2  6      O      P
3  7      Q      R
4  8      S      T

In [30]:
# To Concate two table
df3=pd.concat([df1,df2],ignore_index=True) 
df3

  id Value1 Value2
0  1      A      B
1  2      C      D
2  3      G      F
3  4      I      H
4  5      S      J
5  2      K      L
6  3      M      N
7  6      O      P
8  7      Q      R
9  8      S      T

In [31]:
import pandas as pd
dic1={'id':['1','2','3','4','5'],'Value1':['A','C','G','I','S'],
      'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'Value1':['K','M','O','Q','S'],
      'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)
df3=pd.concat([df1,df2],axis=0) # To add the data into row wise if
#just change axis=1 then add column wise
df3

  id Value1 Value2
0  1      A      B
1  2      C      D
2  3      G      F
3  4      I      H
4  5      S      J
0  2      K      L
1  3      M      N
2  6      O      P
3  7      Q      R
4  8      S      T

In [32]:
import pandas as pd
dic1={'id':['1','2','3','4','5'],'Value1':['A','C','G','I','S'],
      'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'Value1':['K','M','O','Q','S'],
      'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)
df3=pd.merge(df1,df2,left_on='id',right_on='id')
df3

  id Value1_x Value2_x Value1_y Value2_y
0  2        C        D        K        L
1  3        G        F        M        N

# 7. Join operation in data frame

## 7.1 Full Outer Join:- 

The full outer join combines the results of 

both the left and the right outer joins. The joined data frame will 

contain all records from both the data frames and fill in NaNs for 

missing matches on either side. You can perform a full outer join by 

specifying the how argument as outer in merge() function.

In [33]:
import pandas as pd
dic1={'id':['1','2','3','4','5'],'Value1':['A','C','G','I','S'],
      'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'Value1':['K','M','O','Q','S'],
      'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)
df3=pd.merge(df1,df2,on='id',how='outer')
df3

  id Value1_x Value2_x Value1_y Value2_y
0  1        A        B      NaN      NaN
1  2        C        D        K        L
2  3        G        F        M        N
3  4        I        H      NaN      NaN
4  5        S        J      NaN      NaN
5  6      NaN      NaN        O        P
6  7      NaN      NaN        Q        R
7  8      NaN      NaN        S        T

## 7.2 Inner Join :-

The inner join produce only those records that match in both the dataframe.

You have to pass inner in how argument inside merge() function.

In [34]:
import pandas as pd
dic1={'id':['1','2','3','4','5'],'Value1':['A','C','G','I','S'],
      'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'Value1':['K','M','O','Q','S'],
      'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)
df3=pd.merge(df1,df2,on='id',how='inner')
df3

  id Value1_x Value2_x Value1_y Value2_y
0  2        C        D        K        L
1  3        G        F        M        N

## 7.3 RightJoin :-
    
The  right join produce a complete set of records from data frame B(Right

side Data Frame) with the matching records (where available) in data frame

A( Left side data frame). If there is no match right side will containnull.

You have to pass right in how argument inside merge() function.

In [35]:
import pandas as pd
dic1={'id':['1','2','3','4','5'],'Value1':['A','C','G','I','S'],
      'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'Value1':['K','M','O','Q','S'],
      'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)
df3=pd.merge(df1,df2,on='id',how='right')
df3

  id Value1_x Value2_x Value1_y Value2_y
0  2        C        D        K        L
1  3        G        F        M        N
2  6      NaN      NaN        O        P
3  7      NaN      NaN        Q        R
4  8      NaN      NaN        S        T

## 7.4Left Join :- 

The  left join produce a complete set of records from data frame A(Left 

side Data Frame) with the matching records (where available) in data frame 

B( Right side data frame). If there is no match left side will containnull.

You have to pass left in how argument inside merge() function.

In [36]:
import pandas as pd
dic1={'id':['1','2','3','4','5'],'Value1':['A','C','G','I','S'],
      'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'Value1':['K','M','O','Q','S'],
      'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)
df3=pd.merge(df1,df2,on='id',how='left')
df3

  id Value1_x Value2_x Value1_y Value2_y
0  1        A        B      NaN      NaN
1  2        C        D        K        L
2  3        G        F        M        N
3  4        I        H      NaN      NaN
4  5        S        J      NaN      NaN

## 7.5 Joining on Index :-

Sometimes you have to perform the join on the indexes or the row labels.

In [37]:
import pandas as pd
dic1={'id':['1','2','3','4','5'],'Value1':['A','C','G','I','S'],
      'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'Value1':['K','M','O','Q','S'],
      'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)
df3=pd.merge(df1,df2,right_index=True,left_index=True,how='left')
df3

  id_x Value1_x Value2_x id_y Value1_y Value2_y
0    1        A        B    2        K        L
1    2        C        D    3        M        N
2    3        G        F    6        O        P
3    4        I        H    7        Q        R
4    5        S        J    8        S        T

## To save the DataFrame into csv file

In [38]:
import pandas as pd
dic={'Name':['Suresh','Akash','Naveen','Aadi','Anamika'],'Subject':
     ['Hindi','English','Maths','Science','Social Science'],
   'Mark_Suresh':[78,90,53,82,85],'Mark_Akash':[79,85,89,86,78],'Mark_Naveen':
   [98,90,79,86,97],'Mark_Aadi':[67,89,96,86,78],'Mark_Anamika':[86,78,56,98,86]}
df1=pd.DataFrame(dic)
df1

,Name,Subject,Mark_Suresh,Mark_Akash,Mark_Naveen,Mark_Aadi,Mark_Anamika
0,Suresh,Hindi,78,79,98,67,86
1,Akash,English,90,85,90,89,78
2,Naveen,Maths,53,89,79,96,56
3,Aadi,Science,82,86,86,86,98
4,Anamika,Social Science,85,78,97,78,86

In [39]:
# To Save the dataframe in the CSV file
df1.to_csv('Dr. Indrajeet Sir Python 3rd sem Lab.csv')

# 8.Grouping data
Grouping is to provide a mapping of labels to group names.Pandas datasets can be split into any of their object.

Syntax

obj.groupby(key)

obj.groupby(key, axis=1)

obj.groupby([key1, key2])

In [40]:
# importing pandas module
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
   
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
 
df

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [41]:
# using groupby function 
# with one key
df.groupby('Name')
print(df.groupby('Name').groups)

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [42]:
# using groupby function 
# with one key
df.groupby('Qualification')
print(df.groupby('Qualification').groups)

{'B.Tech': [4], 'B.com': [5], 'MA': [1, 7], 'MCA': [2], 'Msc': [0, 6], 'Phd': [3]}

In [43]:
# applying groupby() function to group the data on Name value.
gk=df.groupby('Qualification')
gk.first()

                 Name  Age    Address
Qualification
B.Tech         Gaurav   33    Jaunpur
B.com            Anuj   36     Kanpur
MA               Anuj   24     Kanpur
MCA               Jai   22  Allahabad
Msc               Jai   27     Nagpur
Phd            Princi   32    Kannuaj

In [44]:
# iterating an element of group
grp=df.groupby('Qualification')
for name,group in grp:
    print(name)
    print(group)
    print()

B.Tech
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

B.com
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

MA
   Name  Age  Address Qualification
1  Anuj   24   Kanpur            MA
7  Abhi   32  Aligarh            MA

MCA
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

Msc
     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
6  Princi   27  Allahabad           Msc

Phd
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

In [47]:
# To iterate the multiple column that containg multiple keys
grp=df.groupby(['Name','Qualification'])
for name,group in grp:
    print(name)
    print(group)
   # print()

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA
('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com
('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech
('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA
('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc
('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc
('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

# 9.Working with date and time using Pandas
Encountering time series data is very usual.

In [48]:
from datetime import date
d=date(2004,3,2)
print(d)
print(type(d))

2004-03-02
<class 'datetime.date'>

## 9.1 Year,Month,Day extraction

In [49]:
import pandas as pd
 
# Creating a Timestamp object
timestamp = pd.Timestamp('2023-10-04 15:30:00')
 
# Extracting the year from the Timestamp
year = timestamp.year
 
# Printing the extracted year
print(year)
 
# Extracting the month from the Timestamp
month = timestamp.month
 
# Printing the extracted month
print(month)
 
# Extracting the day from the Timestamp
day = timestamp.day
print(day)

2023
10
4

## 9.2 Time, Weekday, Quarter extraction

In [50]:
import pandas as pd
# Extracting the hour from the Timestamp
hour = timestamp.hour
 
# Printing the extracted hour
print(hour)
 
# Extracting the minute from the Timestamp
minute = timestamp.minute
 
# Printing the extracted minute
print(minute)
# Extracting the weekday from the Timestamp
weekday = timestamp.weekday()
 
# Printing the extracted weekday
print(weekday)
 
# Extracting the quarter from the Timestamp
quarter = timestamp.quarter
 
# Printing the extracted quarter
print(quarter)

15
30
2
4

## 9.3 UTC and time zone conversion:
Convert between UTC (Coordinated Universal Time) and local time zones.

In [51]:
import pandas as pd

# Example timestamp
timestamp = pd.Timestamp('2024-10-14 08:00:00')

# Localize to a specific time zone (e.g., 'Asia/Kolkata')
localized_timestamp = timestamp.tz_localize('Asia/Kolkata')

# Convert to another time zone (e.g., 'UTC')
converted_timestamp = localized_timestamp.tz_convert('UTC')

print("Original timestamp:", timestamp)
print("Localized timestamp (Asia/Kolkata):", localized_timestamp)
print("Converted to UTC:", converted_timestamp)

Original timestamp: 2024-10-14 08:00:00
Localized timestamp (Asia/Kolkata): 2024-10-14 08:00:00+05:30
Converted to UTC: 2024-10-14 02:30:00+00:00

## 9.4 To create dataframe date and time with working in  pandas

Step-1: Create a dates dataframe

In [52]:
import pandas as pd
 
# Create dates dataframe with frequency  
data = pd.date_range('1/1/2011', periods = 10, freq ='H')
 
data

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00', '2011-01-01 03:00:00',
               '2011-01-01 04:00:00', '2011-01-01 05:00:00',
               '2011-01-01 06:00:00', '2011-01-01 07:00:00',
               '2011-01-01 08:00:00', '2011-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

Step-2: Create range of dates and show basic features

In [53]:
import pandas as pd
from datetime import datetime

# Create date and time with dataframe
data = pd.date_range('1/1/2011', periods = 10, freq ='H')
 
x = datetime.now()
x.month, x.year

(12, 2024)

Step-3: Divide a given date into features  

pandas.Series.dt.year returns the year of the date time. 

pandas.Series.dt.month returns the month of the date time.

pandas.Series.dt.day returns the day of the date time. 

pandas.Series.dt.hour returns the hour of the date time.

pandas.Series.dt.minute returns the minute of the date time.

In [54]:
# Create date and time with dataframe
rng = pd.DataFrame()
rng['date'] = pd.date_range('1/1/2011', periods = 72, freq ='H')
 
# Print the dates in dd-mm-yy format
rng[:5]
 
# Create features for year, month, day, hour, and minute
rng['year'] = rng['date'].dt.year
rng['month'] = rng['date'].dt.month
rng['day'] = rng['date'].dt.day
rng['hour'] = rng['date'].dt.hour
rng['minute'] = rng['date'].dt.minute
 
# Print the dates divided into features
rng.head(3)

                 date  year  month  day  hour  minute
0 2011-01-01 00:00:00  2011      1    1     0       0
1 2011-01-01 01:00:00  2011      1    1     1       0
2 2011-01-01 02:00:00  2011      1    1     2       0